# 데이터 입출력

## 1. csv 파일 적재

- pd.read_csv()
    - 컬럼명이 존재하는 데이터
    - 컬럼명이 없는 데이터
    - 구분자 설정

In [1]:
import pandas as pd

In [2]:
# data/ex1.csv 파일읽기 (컬럼명이 존재하는 csv파일)
# read_csv 기본동작 : 첫 행 데이터를 컬럼으로 사용
data = pd.read_csv('data/ex1.csv')
print(type(data))
data

<class 'pandas.core.frame.DataFrame'>

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
# data/ex2.csv 읽(컬럼명이 없는 csv파일)
# read_csv
data = pd.read_csv('data/ex2.csv', header=None)
data

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [13]:
# 컬럼명 부여하기 (abcde)
data.columns = list('abcde')
data

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [16]:
# data/ex3.csv읽기
# 기본 구분자 ,
# read_csv() : sep="다른 구분자"로 처리가능
data2 = pd.read_csv('data/ex3.csv')
data2

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [25]:
# 구분자를 \t로 바꿔서 가져와보세요
pd.read_csv('data/ex3.csv', sep="\t")

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [23]:
# 구분자 "," " " "\t" "/" "\" => \s+ 로 처리해야함
pd.read_csv('data/ex3.csv', sep="\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [27]:
# data/ex4.csv 읽기(주석이 포함된 파일 읽기)
# 파라미터1 : skiprows = [생략할 로우 인덱스 번호]
pd.read_csv('data/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
# 파라미터 2 : comment = '주석기호'(주석 앞에 붙인 기호, 현재문서는 #이 붙음)
pd.read_csv('data/ex4.csv', comment="#")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [45]:
pd.read_csv('data/ex5.csv', comment="#")

                                     a b c d message
0  /* just wanted to make things more difficult f...
1     who reads CSV files with computers  anyway? */
2                                      1 2 3 4 hello
3                                      5 6 7 8 world
4                                     9 10 11 12 foo

In [29]:
# 파일 읽기 (첫번째 시트 읽어옴, 디폴트)
pd.read_excel('data/ex6.xlsx')

   a   b
0  1   2
1  5   6
2  9  10

In [30]:
# 두번째 시트 읽기 : sheet_name = '시트명'
pd.read_excel('data/ex6.xlsx', sheet_name='시트2')

    c   d message
0   3   4   hello
1   7   8   world
2  11  12     foo

In [33]:
# 모든 시트 다 읽어오기
# sheet_name 파라미터 설정 :None
data = pd.read_excel('data/ex6.xlsx', sheet_name=None)

In [34]:
data

{'시트1':    a   b
 0  1   2
 1  5   6
 2  9  10,
 '시트2':     c   d message
 0   3   4   hello
 1   7   8   world
 2  11  12     foo}

In [35]:
data.keys()

dict_keys(['시트1', '시트2'])

In [36]:
data.values()

dict_values([   a   b
0  1   2
1  5   6
2  9  10,     c   d message
0   3   4   hello
1   7   8   world
2  11  12     foo])

In [37]:
data['시트1']

   a   b
0  1   2
1  5   6
2  9  10

In [46]:
data['시트2']

    c   d message
0   3   4   hello
1   7   8   world
2  11  12     foo

In [47]:
# 시트1, 시트2의 데이터를 data1, data2변수에 한번에 저장하기
data1, data2 = data.values()

In [48]:
data1

   a   b
0  1   2
1  5   6
2  9  10

In [49]:
data2

    c   d message
0   3   4   hello
1   7   8   world
2  11  12     foo